// --створити масив та вивести його в консоль:
//     - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу

// let arr1 = [1, 2, 3, 4, 5];
// console.log(arr1);
// let arr2 = ['one', 'two', 'three', 'four', 'five'];
// console.log(arr2);
// let arr3 = [1, 2, 'three', true, false];
// console.log(arr3);


// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

// let array = [];
// array[0] = 1;
// array[1] = 'two';
// array[2] = true;
// array[3] = false;
// array[4] = 'five';
// console.log(array);


// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині

// for (let i = 0; i < 10; i++) {
//     document.write('<div>Якась ітерація</div>');
// }


// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// for (let i = 0; i < 10; i++) {
//     document.write('<div>Ітерація номер ' + (i + 1) + '</div>');
// }


// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// let i = 0;
// while (i < 10) {
//     document.write('<div>Якась ітерація циклу while</div>');
//     i++
// }


// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
// let i = 0;
// while (i < 10) {
//     document.write('<div>Ітерація номер ' + (i + 1) + ' циклу while</div>');
//     i++
// }


// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// let numbersArray = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
// for (let i = 0; i < numbersArray.length; i++) {
//     console.log(numbersArray[i]);
// }


// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// let stringsArray = ['one', 'two', 'three', 'four', 'five', 'six', 'seven', 'eight', 'nine', 'ten'];
// for (let i = 0; i < stringsArray.length; i++) {
//     console.log(stringsArray[i]);
// }


// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// let anyArray = ['1', 2, 3, true, false, undefined, null, {}, [], Symbol('s')];
// let i = 0;
// while (i < anyArray.length) {
//     console.log(anyArray[i]);
//     i++
// }


// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// let anyArray = ['1', 2, 3, true, false, 1, 'null', 'bla bla', 'wow', false];
// for (let i = 0; i < anyArray.length; i++) {
//     if (typeof anyArray[i] === "boolean"){
//         console.log(anyArray[i]);
//     }
// }


// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// let anyArray = ['1', 2, 3, true, false, 1, 'null', 'bla bla', 'wow', false];
// for (let i = 0; i < anyArray.length; i++) {
//     if (typeof anyArray[i] === "number"){
//         console.log(anyArray[i]);
//     }
// }


// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
// let anyArray = ['1', 2, 3, true, false, 1, 'null', 'bla bla', 'wow', false];
// for (let i = 0; i < anyArray.length; i++) {
//     if (typeof anyArray[i] === "string"){
//         console.log(anyArray[i]);
//     }
// }


// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// let arr = [];
// arr[0] = 1;
// arr[1] = true;
// arr[2] = 2;
// arr[3] = false;
// arr[4] = 'bla bla';
// arr[5] = ['bla', 'bla'];
// arr[6] = {name: 'ivan'};
// arr[7] = null;
// arr[8] = undefined;
// arr[9] = 'car';
// for (let i = 0; i < arr.length; i++) {
//     console.log(arr[i]);
// }


// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// for (let i = 0; i < 10; i++){
//     console.log('iteranion ' + (i + 1));
//     document.write('iteranion ' + (i + 1) + '<br>');
// }


// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// for (let i = 0; i < 100; i++){
//     console.log('iteranion ' + (i + 1));
//     document.write('iteranion ' + (i + 1) + '<br>');
// }


// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// for (let i = 0; i < 200; i += 2){
//     console.log('iteranion ' + (i + 1));
//     document.write('iteranion ' + (i + 1) + '<br>');
// }


// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// for (let i = 0; i < 100; i++){
//     if (i % 2 === 0) {
//         console.log('iteranion ' + (i));
//         document.write('iteranion ' + (i) + '<br>');
//     }
// }


// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
// for (let i = 0; i < 100; i++){
//     if (i % 2 === 1) {
//         console.log('iteranion ' + (i));
//         document.write('iteranion ' + (i) + '<br>');
//     }
// }


// - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)
// let minutes = 0;
// let seconds = 0;
// while (minutes < 2) {
//     while (seconds < 60) {
//         if (minutes < 10) {
//             minutes = '0' + minutes;
//         }
//         if (seconds < 10) {
//             seconds = '0' + seconds;
//         }
//         let clock = minutes + ':' + seconds;
//         console.log(clock);
//         minutes = parseInt(minutes);
//         seconds = parseInt(seconds);
//         seconds++
//     }
//     seconds = 0;
//     minutes++
// }


// - Відтворити роботу годинника, відрахувавши  2 години 20 хвилини (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)
// let hours = 0;
// let minutes = 0;
// let seconds = 0;
// while (hours < 3) {
//     while (minutes < 60) {
//         while (seconds < 60) {
//             if (hours < 10) {
//                 hours = '0' + hours;
//             }
//             if (minutes < 10) {
//                 minutes = '0' + minutes;
//             }
//             if (seconds < 10) {
//                 seconds = '0' + seconds;
//             }
//             let clock = hours + ':' + minutes + ':' + seconds;
//             console.log(clock);
//             hours = parseInt(hours);
//             minutes = parseInt(minutes);
//             seconds = parseInt(seconds);
//             seconds++
//         }
//         seconds = 0;
//         minutes++
//         if (hours === 2 && minutes === 21){
//             minutes = 60;
//         }
//         if(hours === 2 && minutes === 20){
//             seconds = 61;
//         }
//     }
//     minutes = 0;
//     hours++
// }





// Додатково
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
//
// =================
// =================
// =================
// =================
//
// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice перетворіть масив в [1, 4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
//
//
// ============
//
// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
//     1. перебрати його циклом while
//     2. перебрати його циклом for
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// 10
// створити пустий масив та :
//     - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу.
//
//
// 1
// створити пустий масив та :
//     1. заповнити його 50 парними числами за допомоги циклу.
// 2. заповнити його 50 непарними числами за допомоги циклу.
// 3. используя Math.random заполнить массив из ???(сколько хотите) элементов.
//     диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)
// 2. вывести на консоль  каждый третий елемент
// 3. вывести на консоль  каждый третий елемент
// но при условии что его значение является парным.
// 4. вывести на консоль  каждый третий елемент
// но при условии что он имеет парное значение и
// записать их в другой массив.
// 5. Вывести каждый елемент массива у которого соседний с права элемент - парный
// 5 масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. обрахувати середній чек.
//
// 3 створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// 4 створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо об'єкт є числом,
// додати його в інший масив.
